bachmanity-server/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>

    <servers>
        <server host="localhost" port="3000" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="15" unit="second">
            <users arrivalrate="10" unit="second"></users>
        </arrivalphase>
    </load>

    <sessions>
        <session name="list-lobbies" probability="80" type="ts_http">
            <request>
                <http url="/lobbies" method="GET" />
            </request>
        </session>

        <session name="create-lobbies" probability="20" type="ts_http">
            <request>
                <http url="/lobbies" method="POST" content_type='application/json' contents='{"title": "Hello World", "desc":"description", "currentVideoUrl": "a video URL :P"}'/>
            </request>
        </session>
    </sessions>
</tsung>